# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# 在三个输入到特征金字塔的图片加入ResCBAM, neck中也加入ResCBAM，加在C3后面

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],       # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],       #4
   [-1, 1, ResCBAM, [256]],     #5
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16    6
   [-1, 9, C3, [512]],        #7
   [-1, 1, ResCBAM, [512]],      #8
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32    9
   [-1, 3, C3, [1024]],      # 10
   [-1, 1, ResCBAM, [1024]],         #11
   [-1, 1, SPPF, [1024, 5]],  # 9     12
  ]

# YOLOv5 v6.0
head:
  [[-1, 1, Conv, [512, 1, 1]],    # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #14
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4    # 15
   [-1, 3, C3, [512, False]],  # 13     16

   [-1, 1, Conv, [256, 1, 1]],     # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 18
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3    19
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)    20
   [-1, 1, ResCBAM, [256]],         #21

   [-1, 1, Conv, [256, 3, 2]],                      # 22
   [[-1, 17], 1, Concat, [1]],  # cat P4             23
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)    24
   [-1, 1, ResCBAM, [512]],         #25

   [-1, 1, Conv, [512, 3, 2]],                      # 26
   [[-1, 13], 1, Concat, [1]],  # cat head P5         27
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)     28
   [-1, 1, ResCBAM, [1024]],         #29

   [[21, 25, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
